In [4]:
import pandas as pd

In [6]:
SpotCrudePrices_2013_Data={
 'U.K. Brent' : {'2013-Q1':112.9, '2013-Q2':103.0, '2013-Q3':110.1, '2013-Q4':109.4},
 'Dubai':{'2013-Q1':108.1, '2013-Q2':100.8,'2013-Q3':106.1,'2013-Q4':106.7},
 'West Texas Intermediate':{'2013-Q1':94.4, '2013-Q2':94.2, '2013-Q3':105.8,'2013-Q4':97.4}}

In [8]:
SpotCrudePrices_2013=pd.DataFrame.from_dict(SpotCrudePrices_2013_Data)

In [9]:
SpotCrudePrices_2013

         U.K. Brent  Dubai  West Texas Intermediate
2013-Q1       112.9  108.1                     94.4
2013-Q2       103.0  100.8                     94.2
2013-Q3       110.1  106.1                    105.8
2013-Q4       109.4  106.7                     97.4

In [18]:
dubai_prices = SpotCrudePrices_2013['Dubai']

In [19]:
dubai_prices

2013-Q1    108.1
2013-Q2    100.8
2013-Q3    106.1
2013-Q4    106.7
Name: Dubai, dtype: float64

In [21]:
SpotCrudePrices_2013[['West Texas Intermediate','U.K. Brent']]

         West Texas Intermediate  U.K. Brent
2013-Q1                     94.4       112.9
2013-Q2                     94.2       103.0
2013-Q3                    105.8       110.1
2013-Q4                     97.4       109.4

In [22]:
dubai_prices['2013-Q1']

108.1

In [25]:
SpotCrudePrices_2013.Dubai

2013-Q1    108.1
2013-Q2    100.8
2013-Q3    106.1
2013-Q4    106.7
Name: Dubai, dtype: float64

In [27]:
SpotCrudePrices_2013.columns = ['Dubai','UK_Brent','West_Texas_Intermediate']

In [28]:
SpotCrudePrices_2013

         Dubai  UK_Brent  West_Texas_Intermediate
2013-Q1  112.9     108.1                     94.4
2013-Q2  103.0     100.8                     94.2
2013-Q3  110.1     106.1                    105.8
2013-Q4  109.4     106.7                     97.4

In [29]:
SpotCrudePrices_2013.UK_Brent

2013-Q1    108.1
2013-Q2    100.8
2013-Q3    106.1
2013-Q4    106.7
Name: UK_Brent, dtype: float64

In [37]:
SpotCrudePrices_2013[[1]]

KeyError: "None of [Index([1], dtype='int32')] are in the [columns]"

In [45]:
SpotCrudePrices_2013[:]

         Dubai  UK_Brent  West_Texas_Intermediate
2013-Q1  112.9     108.1                     94.4
2013-Q2  103.0     100.8                     94.2
2013-Q3  110.1     106.1                    105.8
2013-Q4  109.4     106.7                     97.4

In [50]:
SpotCrudePrices_2013[::-1]

         Dubai  UK_Brent  West_Texas_Intermediate
2013-Q4  109.4     106.7                     97.4
2013-Q3  110.1     106.1                    105.8
2013-Q2  103.0     100.8                     94.2
2013-Q1  112.9     108.1                     94.4